package com._365d1.crm.model.enums;
// +----------------------------------------------------------------------
// | 官方网站: www.365d1.com
// +----------------------------------------------------------------------
// | 功能描述: 
// +----------------------------------------------------------------------
// | 时　　间: 2021/10/20
// +----------------------------------------------------------------------
// | 代码创建: 朱荻 <292018748@qq.com>
// +----------------------------------------------------------------------
// | 版本信息: V1.0.0
// +----------------------------------------------------------------------
// | 代码修改:（修改人 - 修改时间）
// +----------------------------------------------------------------------

import io.github.nunumao.common.utils.enums.Dictionary;
import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
@Getter
public enum CrmCustomerStatus implements Dictionary {

    FIRST("初步接触", 0),
    ENTER("确定意向", 1),
    IMPORTANT("重点跟进", 2),
    SIGN("签约客户", 3),
    PAUSE("停滞客户", 4),
    LOST("丢单客户", 5);

    private String key;
    private Object value;

}
